wgfy1/stm32f407/BSP/LCD/lcd.c
        case D2U_L2R://从下到上,从左到右
            regval |= (1 << 7) | (0 << 6) | (1 << 5);
            break;

        case D2U_R2L://从下到上,从右到左
            regval |= (1 << 7) | (1 << 6) | (1 << 5);
            break;
    }

    if (makerbase_lcd.id == 0X5510)dirreg = 0X3600;
    else dirreg = 0X36;

    if (makerbase_lcd.id == 0X9341 || makerbase_lcd.id == 0X7789)   //9341 & 7789 要设置BGR位
    {
        regval |= 0X08;
    }

    LCD_WriteReg(dirreg, regval);

    if (makerbase_lcd.id != 0X1963)   //1963不做坐标处理
    {
        if (regval & 0X20)
        {
            if (makerbase_lcd.width < makerbase_lcd.height)   //交换X,Y
            {
                temp = makerbase_lcd.width;
                makerbase_lcd.width = makerbase_lcd.height;
                makerbase_lcd.height = temp;
            }
        }
        else
        {
            if (makerbase_lcd.width > makerbase_lcd.height)   //交换X,Y
            {
                temp = makerbase_lcd.width;
                makerbase_lcd.width = makerbase_lcd.height;
                makerbase_lcd.height = temp;
            }
        }
    }

    //设置显示区域(开窗)大小
    if (makerbase_lcd.id == 0X5510)
    {
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(0);
        LCD_WR_REG(makerbase_lcd.setxcmd + 1);
        LCD_WR_DATA(0);
        LCD_WR_REG(makerbase_lcd.setxcmd + 2);
        LCD_WR_DATA((makerbase_lcd.width - 1) >> 8);
        LCD_WR_REG(makerbase_lcd.setxcmd + 3);
        LCD_WR_DATA((makerbase_lcd.width - 1) & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(0);
        LCD_WR_REG(makerbase_lcd.setycmd + 1);
        LCD_WR_DATA(0);
        LCD_WR_REG(makerbase_lcd.setycmd + 2);
        LCD_WR_DATA((makerbase_lcd.height - 1) >> 8);
        LCD_WR_REG(makerbase_lcd.setycmd + 3);
        LCD_WR_DATA((makerbase_lcd.height - 1) & 0XFF);
    }
    else
    {
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(0);
        LCD_WR_DATA(0);
        LCD_WR_DATA((makerbase_lcd.width - 1) >> 8);
        LCD_WR_DATA((makerbase_lcd.width - 1) & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(0);
        LCD_WR_DATA(0);
        LCD_WR_DATA((makerbase_lcd.height - 1) >> 8);
        LCD_WR_DATA((makerbase_lcd.height - 1) & 0XFF);
    }
}

//画点
//x,y:坐标
//POINT_COLOR:此点的颜色
void LCD_DrawPoint(uint16_t x,uint16_t y)
{
	LCD_SetCursor(x,y);		//设置光标位置 
	LCD_WriteRAM_Prepare();	//开始写入GRAM
	LCD->LCD_RAM=POINT_COLOR; 
}
//快速画点
//x,y:坐标
//color:颜色
void LCD_Fast_DrawPoint(uint16_t x,uint16_t y,uint16_t color)
{	   
 if (makerbase_lcd.id == 0X5510)
    {
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(x >> 8);
        LCD_WR_REG(makerbase_lcd.setxcmd + 1);
        LCD_WR_DATA(x & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(y >> 8);
        LCD_WR_REG(makerbase_lcd.setycmd + 1);
        LCD_WR_DATA(y & 0XFF);
    }
	else if (makerbase_lcd.id == 0X1963)
    {
        if (makerbase_lcd.dir == 0)x = makerbase_lcd.width - 1 - x;

        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(x >> 8);
        LCD_WR_DATA(x & 0XFF);
        LCD_WR_DATA(x >> 8);
        LCD_WR_DATA(x & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(y >> 8);
        LCD_WR_DATA(y & 0XFF);
        LCD_WR_DATA(y >> 8);
        LCD_WR_DATA(y & 0XFF);
    }
	else     //9341/5310/7789等设置坐标
    {
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(x >> 8);
        LCD_WR_DATA(x & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(y >> 8);
        LCD_WR_DATA(y & 0XFF);
    }

    LCD->LCD_REG=makerbase_lcd.wramcmd; 
    LCD->LCD_RAM=color; 
}

//SSD1963 背光设置
//pwm:背光等级,0~100.越大越亮.
void LCD_SSD_BackLightSet(uint8_t pwm)
{	
	LCD_WR_REG(0xBE);	//配置PWM输出
	LCD_WR_DATA(0x05);	//1设置PWM频率
	LCD_WR_DATA(pwm*2.55);//2设置PWM占空比
	LCD_WR_DATA(0x01);	//3设置C
	LCD_WR_DATA(0xFF);	//4设置D
	LCD_WR_DATA(0x00);	//5设置E
	LCD_WR_DATA(0x00);	//6设置F
}

//设置LCD显示方向
//dir:0,竖屏；1,横屏
void LCD_Display_Dir(uint8_t dir)
{
    makerbase_lcd.dir = dir;       //竖屏/横屏

    if (dir == 0)           //竖屏
    {
        makerbase_lcd.width = 240;
        makerbase_lcd.height = 320;

        if (makerbase_lcd.id == 0x5510)
        {
            makerbase_lcd.wramcmd = 0X2C00;
            makerbase_lcd.setxcmd = 0X2A00;
            makerbase_lcd.setycmd = 0X2B00;
            makerbase_lcd.width = 480;
            makerbase_lcd.height = 800;
        }
        else if (makerbase_lcd.id == 0X1963)
        {
            makerbase_lcd.wramcmd = 0X2C;  //设置写入GRAM的指令
            makerbase_lcd.setxcmd = 0X2B;  //设置写X坐标指令
            makerbase_lcd.setycmd = 0X2A;  //设置写Y坐标指令
            makerbase_lcd.width = 480;     //设置宽度480
            makerbase_lcd.height = 800;    //设置高度800
        }
        else                        //其他IC, 包括: 9341 / 5310 / 7789等IC
        {
            makerbase_lcd.wramcmd = 0X2C;
            makerbase_lcd.setxcmd = 0X2A;
            makerbase_lcd.setycmd = 0X2B;
        }

        if (makerbase_lcd.id == 0X5310)    //如果是5310 则表示是 320*480分辨率
        {
            makerbase_lcd.width = 320;
            makerbase_lcd.height = 480;
        }
    }
    else     //横屏
    {
        makerbase_lcd.width = 320;
        makerbase_lcd.height = 240;

        if (makerbase_lcd.id == 0x5510)
        {
            makerbase_lcd.wramcmd = 0X2C00;
            makerbase_lcd.setxcmd = 0X2A00;
            makerbase_lcd.setycmd = 0X2B00;
            makerbase_lcd.width = 800;
            makerbase_lcd.height = 480;
        }
        else if (makerbase_lcd.id == 0X1963)
        {
            makerbase_lcd.wramcmd = 0X2C;  //设置写入GRAM的指令
            makerbase_lcd.setxcmd = 0X2A;  //设置写X坐标指令
            makerbase_lcd.setycmd = 0X2B;  //设置写Y坐标指令
            makerbase_lcd.width = 800;     //设置宽度800
            makerbase_lcd.height = 480;    //设置高度480
        }
        else                        //其他IC, 包括: 9341 / 5310 / 7789等IC
        {
            makerbase_lcd.wramcmd = 0X2C;
            makerbase_lcd.setxcmd = 0X2A;
            makerbase_lcd.setycmd = 0X2B;
        }

        if (makerbase_lcd.id == 0X5310)    //如果是5310 则表示是 320*480分辨率
        {
            makerbase_lcd.width = 480;
            makerbase_lcd.height = 320;
        }
    }

    LCD_Scan_Dir(DFT_SCAN_DIR);     //默认扫描方向
}

//设置窗口,并自动设置画点坐标到窗口左上角(sx,sy).
//sx,sy:窗口起始坐标(左上角)
//width,height:窗口宽度和高度,必须大于0!!
//窗体大小:width*height.
void LCD_Set_Window(uint16_t sx, uint16_t sy, uint16_t width, uint16_t height)
{
    uint16_t twidth, theight;
    twidth = sx + width - 1;
    theight = sy + height - 1;

