wgfy1/stm32f407/BSP/LCD/lcd.c
    if (makerbase_lcd.id == 0X1963 && makerbase_lcd.dir != 1)     //1963竖屏特殊处理
    {
        sx = makerbase_lcd.width - width - sx;
        height = sy + height - 1;
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(sx >> 8);
        LCD_WR_DATA(sx & 0XFF);
        LCD_WR_DATA((sx + width - 1) >> 8);
        LCD_WR_DATA((sx + width - 1) & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(sy >> 8);
        LCD_WR_DATA(sy & 0XFF);
        LCD_WR_DATA(height >> 8);
        LCD_WR_DATA(height & 0XFF);
    }
    else if (makerbase_lcd.id == 0X5510)
    {
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(sx >> 8);
        LCD_WR_REG(makerbase_lcd.setxcmd + 1);
        LCD_WR_DATA(sx & 0XFF);
        LCD_WR_REG(makerbase_lcd.setxcmd + 2);
        LCD_WR_DATA(twidth >> 8);
        LCD_WR_REG(makerbase_lcd.setxcmd + 3);
        LCD_WR_DATA(twidth & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(sy >> 8);
        LCD_WR_REG(makerbase_lcd.setycmd + 1);
        LCD_WR_DATA(sy & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd + 2);
        LCD_WR_DATA(theight >> 8);
        LCD_WR_REG(makerbase_lcd.setycmd + 3);
        LCD_WR_DATA(theight & 0XFF);
    }
    else     //9341/5310/7789/1963横屏 等 设置窗口
    {
        LCD_WR_REG(makerbase_lcd.setxcmd);
        LCD_WR_DATA(sx >> 8);
        LCD_WR_DATA(sx & 0XFF);
        LCD_WR_DATA(twidth >> 8);
        LCD_WR_DATA(twidth & 0XFF);
        LCD_WR_REG(makerbase_lcd.setycmd);
        LCD_WR_DATA(sy >> 8);
        LCD_WR_DATA(sy & 0XFF);
        LCD_WR_DATA(theight >> 8);
        LCD_WR_DATA(theight & 0XFF);
    }
}

//初始化lcd
//该初始化函数可以初始化各种ILI93XX液晶,但是其他函数是基于ILI9320的!!!
//在其他型号的驱动芯片上没有测试! 
void LCD_Init(void)
{ 	
	
 	delay_ms(50); // delay 50 ms 
	
	//尝试9341 ID的读取		
	LCD_WR_REG(0XD3);				   
	makerbase_lcd.id=LCD_RD_DATA();	//dummy read 	
	makerbase_lcd.id=LCD_RD_DATA();	//读到0X00
	makerbase_lcd.id=LCD_RD_DATA();   	//读取93								   
	makerbase_lcd.id<<=8;
	makerbase_lcd.id|=LCD_RD_DATA();  	//读取41 	   			   
	if(makerbase_lcd.id!=0X9341)		//非9341,尝试是不是7789
	{
        LCD_WR_REG(0X04);
        makerbase_lcd.id = LCD_RD_DATA();      //dummy read
        makerbase_lcd.id = LCD_RD_DATA();      //读到0X85
        makerbase_lcd.id = LCD_RD_DATA();      //读取0X85
        makerbase_lcd.id <<= 8;
        makerbase_lcd.id |= LCD_RD_DATA();     //读取0X52

        if (makerbase_lcd.id == 0X8552)        //将8552的ID转换成7789
        {
            makerbase_lcd.id = 0x7789;
        }

        if (makerbase_lcd.id != 0x7789)        //也不是ST7789, 尝试是不是 7789
        {
            LCD_WR_REG(0XD4);				   
            makerbase_lcd.id=LCD_RD_DATA();//dummy read  
            makerbase_lcd.id=LCD_RD_DATA();//读回0X01	 
            makerbase_lcd.id=LCD_RD_DATA();//读回0X53	
            makerbase_lcd.id<<=8;	 
            makerbase_lcd.id|=LCD_RD_DATA();	//这里读回0X10	 
            if(makerbase_lcd.id!=0X5310)		//也不是NT35310,尝试看看是不是NT35510
            {
                //发送秘钥（厂家提供,照搬即可）
                LCD_WriteReg(0xF000, 0x0055);
                LCD_WriteReg(0xF001, 0x00AA);
                LCD_WriteReg(0xF002, 0x0052);
                LCD_WriteReg(0xF003, 0x0008);
                LCD_WriteReg(0xF004, 0x0001);

                LCD_WR_REG(0xC500);             //读取ID高8位
                makerbase_lcd.id = LCD_RD_DATA();      //读回0X55
                makerbase_lcd.id <<= 8;

                LCD_WR_REG(0xC501);             //读取ID低8位
                makerbase_lcd.id |= LCD_RD_DATA();     //读回0X10
                delay_ms(5);                    //兼容1963驱动
                if(makerbase_lcd.id==0x8000)makerbase_lcd.id=0x5510;//NT35510读回的ID是8000H,为方便区分,我们强制设置为5510
                if(makerbase_lcd.id!=0X5510)			//也不是NT5510,尝试看看是不是SSD1963
                {
                    LCD_WR_REG(0XA1);
                    makerbase_lcd.id = LCD_RD_DATA();
                    makerbase_lcd.id = LCD_RD_DATA();  //读回0X57
                    makerbase_lcd.id <<= 8;
                    makerbase_lcd.id |= LCD_RD_DATA(); //读回0X61

                    if (makerbase_lcd.id == 0X5761)makerbase_lcd.id = 0X1963; //SSD1963读回的ID是5761H,为方便区分,我们强制设置为1963
				}
			}
		}
	} 
	
	if(makerbase_lcd.id==0X9341||makerbase_lcd.id == 0X7789 ||makerbase_lcd.id==0X5310||makerbase_lcd.id==0X5510||makerbase_lcd.id==0X1963)//如果是这几个IC,则设置WR时序为最快
	{
		//重新配置写时序控制寄存器的时序   	 							    
		FSMC_Bank1E->BWTR[6]&=~(0XF<<0);//地址建立时间(ADDSET)清零 	 
		FSMC_Bank1E->BWTR[6]&=~(0XF<<8);//数据保存时间清零
		FSMC_Bank1E->BWTR[6]|=3<<0;		//地址建立时间(ADDSET)为3个HCLK =18ns  	 
        if(makerbase_lcd.id == 0X7789)
        {
            FSMC_Bank1E->BWTR[6]|=3<<8; 	//数据保存时间(DATAST)为6ns*3个HCLK=18ns
        }
        else
        {
            FSMC_Bank1E->BWTR[6]|=2<<8; 	//数据保存时间(DATAST)为6ns*3个HCLK=18ns
        }
	}
 	//printf(" LCD ID:%x\r\n",makerbase_lcd.id); //打印LCD ID
	if(makerbase_lcd.id==0X9341)	//9341初始化
	{	 
		LCD_WR_REG(0xCF);  
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0xC1); 
		LCD_WR_DATA(0X30); 
		LCD_WR_REG(0xED);  
		LCD_WR_DATA(0x64); 
		LCD_WR_DATA(0x03); 
		LCD_WR_DATA(0X12); 
		LCD_WR_DATA(0X81); 
		LCD_WR_REG(0xE8);  
		LCD_WR_DATA(0x85); 
		LCD_WR_DATA(0x10); 
		LCD_WR_DATA(0x7A); 
		LCD_WR_REG(0xCB);  
		LCD_WR_DATA(0x39); 
		LCD_WR_DATA(0x2C); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x34); 
		LCD_WR_DATA(0x02); 
		LCD_WR_REG(0xF7);  
		LCD_WR_DATA(0x20); 
		LCD_WR_REG(0xEA);  
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 
		LCD_WR_REG(0xC0);    //Power control 
		LCD_WR_DATA(0x1B);   //VRH[5:0] 
		LCD_WR_REG(0xC1);    //Power control 
		LCD_WR_DATA(0x01);   //SAP[2:0];BT[3:0] 
		LCD_WR_REG(0xC5);    //VCM control 
		LCD_WR_DATA(0x30); 	 //3F
		LCD_WR_DATA(0x30); 	 //3C
		LCD_WR_REG(0xC7);    //VCM control2 
		LCD_WR_DATA(0XB7); 
		LCD_WR_REG(0x36);    // Memory Access Control 
		LCD_WR_DATA(0x48); 
		LCD_WR_REG(0x3A);   
		LCD_WR_DATA(0x55); 
		LCD_WR_REG(0xB1);   
		LCD_WR_DATA(0x00);   
		LCD_WR_DATA(0x1A); 
		LCD_WR_REG(0xB6);    // Display Function Control 
		LCD_WR_DATA(0x0A); 
		LCD_WR_DATA(0xA2); 
		LCD_WR_REG(0xF2);    // 3Gamma Function Disable 
		LCD_WR_DATA(0x00); 
		LCD_WR_REG(0x26);    //Gamma curve selected 
		LCD_WR_DATA(0x01); 
		LCD_WR_REG(0xE0);    //Set Gamma 
		LCD_WR_DATA(0x0F); 
		LCD_WR_DATA(0x2A); 
		LCD_WR_DATA(0x28); 
		LCD_WR_DATA(0x08); 
		LCD_WR_DATA(0x0E); 
		LCD_WR_DATA(0x08); 
		LCD_WR_DATA(0x54); 
		LCD_WR_DATA(0XA9); 
		LCD_WR_DATA(0x43); 
		LCD_WR_DATA(0x0A); 
		LCD_WR_DATA(0x0F); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x00); 		 
		LCD_WR_REG(0XE1);    //Set Gamma 
		LCD_WR_DATA(0x00); 
		LCD_WR_DATA(0x15); 
		LCD_WR_DATA(0x17); 
		LCD_WR_DATA(0x07); 
		LCD_WR_DATA(0x11); 
		LCD_WR_DATA(0x06); 
		LCD_WR_DATA(0x2B); 
		LCD_WR_DATA(0x56); 
		LCD_WR_DATA(0x3C); 
		LCD_WR_DATA(0x05); 
		LCD_WR_DATA(0x10); 
		LCD_WR_DATA(0x0F); 
		LCD_WR_DATA(0x3F); 
		LCD_WR_DATA(0x3F); 
		LCD_WR_DATA(0x0F); 
		LCD_WR_REG(0x2B); 
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x01);
		LCD_WR_DATA(0x3f);
		LCD_WR_REG(0x2A); 
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0x00);
		LCD_WR_DATA(0xef);	 
		LCD_WR_REG(0x11); //Exit Sleep
		delay_ms(120);
		LCD_WR_REG(0x29); //display on	
	}
	else if(makerbase_lcd.id==0x7789)      //7789初始化
    {
         LCD_WR_REG(0x11);

